#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_subnet.subnet: Refreshing state... [id=subnet-004759fb6ef8451a5]
aws_security_group.main: Refreshing state... [id=sg-04062aef08519fea0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_instance.app_server will be created
  + resource "aws_instance" "app_server" {
      + ami                                  = "ami-00c39f71452c08778"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "gurukul-vighnesh"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-004759fb6ef8451a5"
      + tags                                 = {
          + "Name" = "gurukul-vighnesh-esop"
        }
      + tags_all                             = {
          + "Name" = "gurukul-vighnesh-esop"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.main must be replaced
-/+ resource "aws_security_group" "main" {
      ~ arn                    = "arn:aws:ec2:us-east-1:331061725593:security-group/sg-04062aef08519fea0" -> (known after apply)
      ~ id                     = "sg-04062aef08519fea0" -> (known after apply)
      ~ name                   = "terraform-20230324104827477400000001" -> (known after apply)
      ~ name_prefix            = "terraform-" -> (known after apply)
      ~ owner_id               = "331061725593" -> (known after apply)
        tags                   = {
            "Name" = "Traffic Rules"
        }
      ~ vpc_id                 = "vpc-ade72dd0" -> "vpc-019c09a1a0c5b4f6b" # forces replacement
        # (5 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + instance_ip_addr = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @VighneshPath, Action: `pull_request`*